{
    "emotion_nutrients": {
      "sad": {
        "Polyunsaturated Fats": [
          "Omega-3 fatty acids in polyunsaturated fats can help reduce symptoms of depression.",
          "Polyunsaturated fats support brain function and may improve mood regulation when feeling sad."
        ],
        "Vitamin D": [
          "Vitamin D deficiency has been linked to depression, so consuming it may help when feeling sad.",
          "Vitamin D acts on receptors in regions of the brain that regulate mood and emotions."
        ],
        "Magnesium": [
          "Magnesium helps regulate neurotransmitters that influence mood and can reduce symptoms of sadness.",
          "Low magnesium levels have been associated with increased depression and sadness."
        ]
      },
      "happy": {
        "Vitamin C": [
          "Vitamin C is involved in producing neurotransmitters like dopamine and serotonin that help maintain a happy mood.",
          "High vitamin C levels are associated with improved mood and vitality."
        ],
        "Protein": [
          "Protein provides amino acids that are essential for producing mood-regulating neurotransmitters.",
          "A steady supply of protein helps maintain stable blood sugar and sustained energy, supporting a positive mood."
        ]
      },
      "angry": {
        "Magnesium": [
          "Magnesium has a calming effect on the nervous system and can help reduce irritability.",
          "This mineral helps regulate the body's stress-response system, which can be activated during anger."
        ],
        "Vitamin C": [
          "Vitamin C helps reduce stress hormones that may be elevated when angry.",
          "This antioxidant protects the body from stress-related damage during heightened emotions."
        ]
      },
      "neutral": {
        "B Vitamins": [
          "B vitamins support overall brain health and cognitive function for maintaining a balanced mood.",
          "These vitamins play crucial roles in energy production, helping maintain consistent energy levels."
        ],
        "Zinc": [
          "Zinc supports overall cognitive function and emotional regulation.",
          "This mineral is important for neurotransmitter production that helps maintain emotional balance."
        ]
      }
    },
    "nutrients": {
      "Protein": [
        "Protein is made up of amino acids, which are the building blocks for neurotransmitters that regulate mood.",
        "Protein helps stabilize blood sugar levels, preventing mood swings caused by energy crashes."
      ],
      "Calcium": [
        "Calcium plays a role in releasing neurotransmitters which affect mood and mental function.",
        "Calcium helps maintain proper nerve function, which is essential for mood regulation."
      ],
      "Vitamin C": [
        "Vitamin C is a powerful antioxidant that helps protect the brain from oxidative stress.",
        "Vitamin C is needed to produce neurotransmitters like dopamine and serotonin."
      ],
      "Vitamin D": [
        "Vitamin D receptors are found throughout the brain, suggesting its importance in brain function and mood.",
        "Vitamin D may help regulate the conversion of tryptophan into serotonin, a neurotransmitter that affects mood."
      ],
      "Vitamin B12": [
        "Vitamin B12 is essential for the production of S-adenosylmethionine (SAMe), a compound that helps regulate mood.",
        "Vitamin B12 deficiency has been linked to depression and mood disorders."
      ],
      "Iron": [
        "Iron is necessary for producing dopamine, a neurotransmitter involved in mood regulation.",
        "Iron deficiency can lead to fatigue and mood changes due to reduced oxygen transport to the brain."
      ],
      "Magnesium": [
        "Magnesium regulates the activity of NMDA receptors involved in mood and emotions.",
        "Magnesium helps activate B vitamins important for stress response and emotional health."
      ],
      "Zinc": [
        "Zinc influences the production and action of numerous neurotransmitters and hormones.",
        "Zinc plays a key role in regulating the body's response to stress."
      ],
      "Polyunsaturated Fats": [
        "Polyunsaturated fats, especially omega-3s, are important components of brain cell membranes.",
        "Omega-3 fatty acids have anti-inflammatory effects in the brain that may help with mood regulation."
      ]
    }
  }